class WeatherCodeMap {
  static final weatherCode = {
    "0": "Неизвестно",
    "1000": "Ясно",
    "1100": "Облачно с прояснениями",
    "1101": "Переменная облачность",
    "1102": "В основном облачно",
    "1001": "Облачно",
    "2000": "Туман",
    "2100": "Лёгкий туман",
    "4000": "Морось",
    "4001": "Дождь",
    "4200": "Лёгкий дождь",
    "4201": "Ливень",
    "5000": "Снег",
    "5001": "Порывы",
    "5100": "Небольшой снегопад",
    "5101": "Сильный снегопад",
    "6000": "Изморось",
    "6001": "Ледяной дождь",
    "6200": "Лёгкий ледяной дождь",
    "6201": "Сильный ледяной дождь",
    "7000": "Град",
    "7101": "Сильный град",
    "7102": "Небольшой град",
    "8000": "Гроза"
  };

  static final weatherImage = {
    "0": "cloud",
    "1000": "sun",
    "1100": "sun",
    "1101": "cloudsun",
    "1102": "cloud",
    "1001": "clouds",
    "2000": "windcloudsun",
    "2100": "windcloudsun",
    "4000": "littleraincloud",
    "4001": "heavyraincloud",
    "4200": "raincloud",
    "4201": "heavierraincloud",
    "5000": "snowcloud",
    "5001": "wind",
    "5100": "cloudsnowsun",
    "5101": "snowcloud",
    "6000": "snowraincloud",
    "6001": "snowraincloud",
    "6200": "snowraincloud",
    "6201": "snowraincloud",
    "7000": "snowraincloud",
    "7101": "snowraincloud",
    "7102": "snowraincloud",
    "8000": "thunderraincloud"
  };

  static final daysOfWeek = {
    1: 'ПН',
    2: 'ВТ',
    3: 'СР',
    4: 'ЧТ',
    5: 'ПТ',
    6: 'СБ',
    7: 'ВС'
  };
}
